[
{
"body": "What do you call a cow with no legs?\r\n\r\nGround Beef!",
"category": "Animal",
"id": 1,
"title": "Cow With No Legs"
},
{
"body": "What do you call a cow jumping over a barbed wire fence?\r\n\r\nUtter destruction.",
"category": "Animal",
"id": 2,
"title": "Jumping Cow"
},
{
"body": "What's black and white and red all over?\r\n\r\nA newspaper.",
"category": "Other / Misc",
"id": 4,
"title": "Black, White and Red"
},
{
"body": "So, this guy walks into a bar.\r\n\r\nAnd says, \"ouch\".",
"category": "Bar",
"id": 5,
"title": "Guy in a Bar"
},
{
"body": "If the opposite of pro is con, isn't the opposite of progress, congress?",
"category": "One Liners",
"id": 6,
"title": "Progress"
},
{
"body": "I went to a wedding the other day.  Two antennas were getting married.  It wasn't much of a wedding ceremony, but it was one heck of a reception!",
"category": "Puns",
"id": 8,
"title": "Antenna"
},
{
"body": "Joel: \"How's the progress on new house that you are building Pete?\"\r\nPeter: \"Things are really slow at the moment.\"\r\nJoel: \"Yeah, I guess all this rain would be putting a dampener on things...\"",
"category": "Puns",
"id": 10,
"title": "Rain"
},
{
"body": "A little old lady goes to the doctor and says, \"Doctor I have this problem with wind, but it really doesn't bother me too much because they never smell and are always silent.\"\r\n\r\n\"As a matter of fact, I've farted at least 20 times since I've been here in your office.\" The doctor says, \"I see, take these pills and come back to see me next week.\" \r\n\r\nThe next week the lady goes back to his office. \"Doctor,\" she says, \"I don't know what you gave me, but now my farts, although still silent, stink terribly!\" \r\n\r\nThe doctor says, \"Good, Now that we've cleared up your sinuses, let's work on your hearing.\"",
"category": "Medical",
"id": 16,
"title": "Windy"
},
{
"body": "During the wedding rehearsal, the groom approached the pastor with an unusual offer. \"Look, I'll give you $100 if you'll change the wedding vows. When you get to me and the part where I'm to promise to 'love, honour and obey' and 'forsaking all others, be faithful to her forever,' I'd appreciate it if you'd just leave that part out.\" He passed the minister a $100 bill and walked away satisfied.\r\nIt is now the day of the wedding, and the bride and groom have moved to that part of the ceremony where the vows are exchanged. When it comes time for the groom's vows, the pastor looks the young man in the eye and says:\r\n\"Will you promise to prostrate yourself before her, obey her every command and wish, serve her breakfast in bed every morning of your life and swear eternally before God and your lovely wife that you will not ever even look at another woman, as long as you both shall live?\"\r\nThe groom gulped and looked around, and said in a tiny voice, \"Yes.\"\r\nThe groom leaned toward the pastor and hissed, \"I thought we had a deal.\"\r\nThe pastor put the $100 bill into his hand and whispered back, \"She made me a much better offer.\"",
"category": "Men / Women",
"id": 20,
"title": "Bride & Groom"
}
]